// 1.

// Дезоксирибонуклеїнова кислота (ДНК) — це хімічна речовина,
// що міститься в ядрі клітин і несе «інструкції» для розвитку 
// та функціонування живих організмів. У рядках ДНК символи «А» 
// і «Т» доповнюють один одного, як «С» і «G». У вас є функція з
// однією стороною ДНК - вам потрібно отримати іншу комплементарну
// сторону. Нитку ДНК ніколи не буває порожнім або ДНК взагалі немає.

// Приклад:
// DNA_strand("ATTGC") # повертає "TAACG"

const DNA = prompt("Будь ласка, введіть дані  ДНК", "");

function showRNAchain(DNA) {
  let RNA = "";

  if (DNA.length === 0){
    return{
      error: true,
      massage: "Введіть послідовність ДНК"
    }
  }

  for (let i = 0; i < DNA.length; i++) {
    if ((DNA[i] === "g") || (DNA[i] === "G")) {
      RNA+= "C";
    }
    else if ((DNA[i] === "c") || (DNA[i] === "C")) {
      RNA += "G";
    }
    else if ((DNA[i] === "t") || (DNA[i] === "T")) {
      RNA += "A";
    }
    else if ((DNA[i] === "a") || (DNA[i] === "A")) {
      RNA += "T";
    }
    else {
      return{
        error:true,
        massage: "Помилка! Не вірно вказані дані  ДНК"
      }
    }
  }
  return RNA;
}

console.log(showRNAchain(DNA))
