// 3. 

// Ваше замовлення Ваше завдання - відсортувати заданий рядок.
// Кожне слово в рядку міститиме одне число. Це число є позиція, 
// яку має мати слово в результаті. Примітка. Числа можуть бути від 1 до 9. 
// Отже, 1 буде першим словом (а не 0). Якщо вхідний рядок порожній, 
// поверніть порожній рядок. Слова у вхідному рядку будуть містити 
// лише дійсні послідовні числа.

// Приклад:
// "is2 Thi1s T4est 3a" --> "Thi1s is2 3a T4est"
// "4of Fo1r pe6ople g3ood th5e the2" --> "Fo1r the2 g3ood 4of th5e pe6ople"
// "" --> ""

let string = prompt('Введіть рядок слів', 'Приклад: братт3я-українці, Ще1  усмі4хнеться нам2,  дол5я.');
let regExp = /\d/; //* метасимвол \d соответствует поиску  цифр от 0 до 9

function sorting(string) {
    let wordsArr = string.split(' '); //* split()разложения объекта String на массив последовательностей

    wordsArr.sort(function(a, b) {
        return a.match(regExp) - b.match(regExp); //* метод match()возвращает массив совпадений
      });

      return wordsArr.join(' '); //* метод join() объединяет все элементы массива в строку
}

console.log(sorting(string));
